# Bài 11: Xử lý dữ liệu trong Pandas

In [78]:
import pandas as pd

student = pd.DataFrame(
    [
        ['Viet Anh', 'male', 'Yes', 10],
        ['Tuan'    , 'male', 'No', 11],
        ['Quan'    , 'male', 'Yes', 40.3]
    ],
    columns=['name', 'gender', 'on camera', 'score'],
    index=['student 1', 'student 2', 'student 3']
)
student

               name gender on camera  score
student 1  Viet Anh   male       Yes   10.0
student 2      Tuan   male        No   11.0
student 3      Quan   male       Yes   40.3

In [18]:
new = student.replace(['male', 'Yes', 'No'], ['men', 'x', ''], inplace=False)
new

               name gender on camera  score
student 1  Viet Anh    men         x   10.0
student 2      Tuan    men             11.0
student 3      Quan    men         x   40.3

In [37]:
import numpy as np


student
student = student.append({
    'name': 'Viet',
    'gender': 'male',
    'on camera': 'Yes',
    'score': 10,
    'happy': 'sure'
    }, ignore_index=True)

/tmp/ipykernel_10686/1003347314.py:5: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  student = student.append({

In [35]:
student.drop(columns='happy', inplace=True)

In [41]:
student.drop(index=3, inplace=True)

In [42]:
student

       name gender on camera  score happy
0  Viet Anh   male       Yes   10.0   NaN
1      Tuan   male        No   11.0   NaN
2      Quan   male       Yes   40.3   NaN

In [46]:
reviews = pd.read_csv('../Data/wine-reviews/winemag-data-130k-v2.csv', index_col=0)
reviews.head(4)

,country,description,designation,points,price,province,region_1,region_2,taster_name,taster_twitter_handle,title,variety,winery
0,Italy,"Aromas include tropical fruit, broom, brimston...",Vulkà Bianco,87,NaN,Sicily & Sardinia,Etna,NaN,Kerin O’Keefe,@kerinokeefe,Nicosia 2013 Vulkà Bianco (Etna),White Blend,Nicosia
1,Portugal,"This is ripe and fruity, a wine that is smooth...",Avidagos,87,15.0,Douro,NaN,NaN,Roger Voss,@vossroger,Quinta dos Avidagos 2011 Avidagos Red (Douro),Portuguese Red,Quinta dos Avidagos
2,US,"Tart and snappy, the flavors of lime flesh and...",NaN,87,14.0,Oregon,Willamette Valley,Willamette Valley,Paul Gregutt,@paulgwine,Rainstorm 2013 Pinot Gris (Willamette Valley),Pinot Gris,Rainstorm
3,US,"Pineapple rind, lemon pith and orange blossom ...",Reserve Late Harvest,87,13.0,Michigan,Lake Michigan Shore,NaN,Alexander Peartree,NaN,St. Julian 2013 Reserve Late Harvest Riesling ...,Riesling,St. Julian

In [50]:
reviews.points.dtype
reviews.points.astype('float64')

0         87.0
1         87.0
2         87.0
3         87.0
4         87.0
          ...
129966    90.0
129967    90.0
129968    90.0
129969    90.0
129970    90.0
Name: points, Length: 129971, dtype: float64

In [58]:
student.score.astype('int64')
student.score

0    10.0
1    11.0
2    40.3
Name: score, dtype: float64

## Missing data

In [71]:
student.happy.isnull()
student.happy.notnull()

student[student.happy.isnull()]

   name gender on camera  score happy
1  Tuan   male        No   11.0   NaN
2  Quan   male       Yes   40.3   NaN

In [73]:
student.happy.fillna('Nope', inplace=False)

0     abc
1    Nope
2    Nope
Name: happy, dtype: object

In [87]:
student.loc['stuent 1', 'happy'] = np.nan

In [89]:
student.loc[student.happy.notnull(), 'happy'] = 'changed'

In [90]:
student

               name gender on camera  score    happy
student 1  Viet Anh   male       Yes   10.0  changed
student 2      Tuan   male        No   11.0  changed
student 3      Quan   male       Yes   40.3  changed
stuent 1        NaN    NaN       NaN    NaN      NaN

## Renaming

In [91]:
student.rename(columns={'happy': 'test'})

               name gender on camera  score     test
student 1  Viet Anh   male       Yes   10.0  changed
student 2      Tuan   male        No   11.0  changed
student 3      Quan   male       Yes   40.3  changed
stuent 1        NaN    NaN       NaN    NaN      NaN

In [94]:
student.rename(index={'stuent 1': 'student 4'})

               name gender on camera  score    happy
student 1  Viet Anh   male       Yes   10.0  changed
student 2      Tuan   male        No   11.0  changed
student 3      Quan   male       Yes   40.3  changed
student 4       NaN    NaN       NaN    NaN      NaN